src/cf/Reports/ВедомостьТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ВедомостьТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/СоставГруппДоступностиМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоставГруппДоступностиМагазинов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаДоступности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Reports/ВедомостьТоварыНаСкладах/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	УниверсальныйОтчет.ДобавитьПолеГруппировка("БазоваяЕдиницаИзмерения", "Номенклатура", "БазоваяЕдиницаИзмерения", "Базовая единица измерения");
	
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоЕдиницОтчетовНачальныйОстаток", "ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Номенклатура.ЕдиницаДляОтчетов.Коэффициент", "Количество (в ед. отчетов) (нач. ост.)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоЕдиницОтчетовПриход",           "ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Номенклатура.ЕдиницаДляОтчетов.Коэффициент", "Количество (в ед. отчетов) (приход)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоЕдиницОтчетовРасход",           "ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Номенклатура.ЕдиницаДляОтчетов.Коэффициент", "Количество (в ед. отчетов) (расход)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоЕдиницОтчетовКонечныйОстаток",  "ИсточникДанных.КоличествоКонечныйОстаток  * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Номенклатура.ЕдиницаДляОтчетов.Коэффициент", "Количество (в ед. отчетов) (кон. ост.)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоЕдиницОтчетовОборот",           "ИсточникДанных.КоличествоОборот * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / Номенклатура.ЕдиницаДляОтчетов.Коэффициент", "Количество (в ед. отчетов) (оборот)");
	
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоБазовыхЕдНачальныйОстаток",     "ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "Количество (в базовых единицах) (нач. ост.)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоБазовыхЕдПриход",               "ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "Количество (в базовых единицах) (приход)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоБазовыхЕдРасход",               "ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "Количество (в базовых единицах) (расход)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоБазовыхЕдКонечныйОстаток",      "ИсточникДанных.КоличествоКонечныйОстаток  * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "Количество (в базовых единицах) (кон. ост.)");
	УниверсальныйОтчет.ДобавитьПолеРесурс("КоличествоБазовыхЕдОборот",               "ИсточникДанных.КоличествоОборот * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент", "Количество (в базовых единицах) (оборот)");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдНачальныйОстаток", "Начальный остаток", Истина, "ЧЦ=15; ЧДЦ=3", "КолБазовыхЕд", "Количество (в базовых единицах)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдПриход",           "Приход",            Истина, "ЧЦ=15; ЧДЦ=3", "КолБазовыхЕд", "Количество (в базовых единицах)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдРасход",           "Расход",            Истина, "ЧЦ=15; ЧДЦ=3", "КолБазовыхЕд", "Количество (в базовых единицах)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдКонечныйОстаток",  "Конечный остаток",  Истина, "ЧЦ=15; ЧДЦ=3", "КолБазовыхЕд", "Количество (в базовых единицах)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдОборот",           "Оборот",              Ложь, "ЧЦ=15; ЧДЦ=3", "КолБазовыхЕд", "Количество (в базовых единицах)");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовНачальныйОстаток", "Начальный остаток", Ложь, "ЧЦ=15; ЧДЦ=3", "КоличествоЕдиницОтчетов", "Количество (в ед. отчетов)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовПриход",           "Приход",            Ложь, "ЧЦ=15; ЧДЦ=3", "КоличествоЕдиницОтчетов", "Количество (в ед. отчетов)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовРасход",           "Расход",            Ложь, "ЧЦ=15; ЧДЦ=3", "КоличествоЕдиницОтчетов", "Количество (в ед. отчетов)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовКонечныйОстаток",  "Конечный остаток",  Ложь, "ЧЦ=15; ЧДЦ=3", "КоличествоЕдиницОтчетов", "Количество (в ед. отчетов)");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовОборот",           "Оборот",            Ложь, "ЧЦ=15; ЧДЦ=3", "КоличествоЕдиницОтчетов", "Количество (в ед. отчетов)");
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина);
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстаток",, Ложь,, "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриход",,           Ложь,, "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасход",,           Ложь,, "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстаток",,  Ложь,, "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОборот",,           Ложь,, "Количество");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Склад");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("БазоваяЕдиницаИзмерения");
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	Если СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование)="Losev Igor" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|Р.Склад
		|ИЗ РегистрСведений.СоставГруппДоступностиМагазинов КАК Р
		|ГДЕ Р.ГруппаДоступности = &Юзер";
		Запрос.УстановитьПараметр("Юзер", ПараметрыСеанса.ТекущийПользователь.Ссылка);
		
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Доступ=0;
			Сообщить ("Вы не прикреплены к магазину. Обратитесь к руководству");
			возврат;
		КонецЕсли;
		
		Форма = ПолучитьОбщуюФорму("ДополнительныеНастройкиОтч");
		Форма.ОткрытьМодально();
		ТабСклады = Форма.ТабСклад;
		ТабБренды = Форма.ТабБренды;
				
		Если ТабСклады.Количество() = 0 Тогда
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.Использование=Ложь;
		Иначе
			СпискаСкл = Новый СписокЗначений;
			Для каждого ст из ТабСклады Цикл
				СпискаСкл.Добавить(ст.Магазин);
			КонецЦикла;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.Использование=Истина;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.ВидСравнения = ВидСравнения.ВСписке;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.Значение = СпискаСкл;
		КонецЕсли;
		
		Если ТабБренды.Количество()=0 Тогда
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Использование=Ложь;
		Иначе
			СпискаБр = Новый СписокЗначений;
			Для каждого ст из ТабБренды Цикл
				СпискаБр.Добавить(ст.Бренд);
			КонецЦикла;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Использование=Истина;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Значение = СпискаБр;
		КонецЕсли;
	КонецЕсли;
	
	//++ Кузнецов С.А. - Ограничение доступности к складам и выбор группы для Администраторов магазинов - Задача в МегаПлане №1003407 - 29.07.2016
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "УчетнаяЗаписьАдминистратораМагазинов") Тогда
		
		// Проверка на период формирования отчета - промежуток не более 3 месяцев
		Если НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаНач) И НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон) Тогда
			Сообщить("Укажите период формирования отчета!");
			Возврат;
		ИначеЕсли НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаНач) И ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон) Тогда	
			количествоСекунд = УниверсальныйОтчет.ДатаКон - УниверсальныйОтчет.ДатаНач; 
		ИначеЕсли ЗначениеЗаполнено(УниверсальныйОтчет.ДатаНач) И НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон) Тогда
			количествоСекунд = ТекущаяДата() - УниверсальныйОтчет.ДатаНач; 
		Иначе
			количествоСекунд = УниверсальныйОтчет.ДатаКон - УниверсальныйОтчет.ДатаНач;
		КонецЕсли;	
		Если количествоСекунд > 93*86400 Тогда
			Сообщить("Период отчета превышает 3 месяца!");
			Возврат;
		КонецЕсли;

		// Получаем список доступных магазинов для анализа
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Р.Склад КАК Магазин
		|ИЗ
		|	РегистрСведений.СоставГруппДоступностиМагазинов КАК Р
		|ГДЕ
		|	Р.ГруппаДоступности = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			Доступ=0;
			Сообщить("Вы не прикреплены к магазину. Обратитесь к руководству!");
			возврат;
		КонецЕсли;
		
		// Открываем дополнительную форму настроек отчета
		Форма = ПолучитьОбщуюФорму("ДополнительныеНастройкиОтч");			
		МассивДоступныхСкладов = Рез.Выгрузить().ВыгрузитьКолонку("Магазин");		
		Для Каждого доступногоСклада Из МассивДоступныхСкладов Цикл
		   новСтрСклада = Форма.ТабСклад.Добавить();
		   новСтрСклада.Магазин = доступногоСклада;
		КонецЦикла;	
		Форма.ЭлементыФормы.Добавить.Видимость = Ложь;
		Форма.ЭлементыФормы.Склады.ТолькоПросмотр = Истина;
		Форма.ОткрытьМодально();
		ТабСклады = Форма.ТабСклад;
		ТабБренды = Форма.ТабБренды;
		
		Если ТабСклады.Количество() = 0 Тогда
			Сообщить("Нельзя сформировать отчет без указания складов!");
			возврат;
		Иначе
			СпискаСкл = Новый СписокЗначений;
			Для каждого ст из ТабСклады Цикл
				СпискаСкл.Добавить(ст.Магазин);
			КонецЦикла;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.Использование=Истина;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.ВидСравнения = ВидСравнения.ВСписке;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Склад.Значение = СпискаСкл;
		КонецЕсли;
		
		Если ТабБренды.Количество()=0 Тогда
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Использование=Ложь;
		Иначе
			СпискаБр = Новый СписокЗначений;
			Для каждого ст из ТабБренды Цикл
				СпискаБр.Добавить(ст.Бренд);
			КонецЦикла;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Использование=Истина;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
			УниверсальныйОтчет.ПостроительОтчета.Отбор.Номенклатура.Значение = СпискаБр;
		КонецЕсли;
		
		// Изменение структуры отчета
		УниверсальныйОтчет.ПостроительОтчета.ВыводитьДетальныеЗаписи = Истина;
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Номенклатура").ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия;
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Добавить("Регистратор");
		УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Добавить("Регистратор");
		УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля.Добавить("Период");		
		
	КонецЕсли;	
	//-- Кузнецов С.А. - 29.07.2016
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
